---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDir1Generic
source: html/7cba4f5b-1fdc-4612-3c7e-ff738c8cbcd6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDir1Generic Property

"Top/Exterior Major Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpacingTopDir1Generic { get; }
```